"""
חתכת עוגה
ממשו פונקציה בשם get_recipe_price, שלה יש:

פרמטר בשם prices, שיקבל מילון של מצרכים הדרושים כדי להכין מתכון מסוים.
מפתח המילון יהיה שם המוצר, וערך המילון יהיה המחיר שלו ל־100 גרם.
הניחו ששמו של כל רכיב הוא מילה אחת, ללא רווחים וללא תווים מיוחדים.
פרמטר רשות בשם optionals שיקבל רשימה של רכיבים שנתעלם מהם, משמע – לא נקנה מהם בכלל.
אם הפרמטר לא יצוין, יש להתייחס לכל הרכיבים שהועברו.
עבור כל רכיב שהועבר ב־prices, יש להעביר ארגומנט הנושא את שמו של הרכיב.
ערך הארגומנט צריך להיות כמות הרכיב (בגרמים) שממנה אנחנו רוצים לקנות עבור המתכון.
הפונקציה תחזיר את המחיר שעלינו לשלם על קניית כל המצרכים.

הקריאה get_recipe_price({'chocolate': 18, 'milk': 8}, chocolate=200, milk=100)
תחזיר 44
הקריאה get_recipe_price({'chocolate': 18, 'milk': 8}, optionals=['milk'], chocolate=300)
תחזיר 54
הקריאה get_recipe_price({})
תחזיר 0
"""

def get_recipe_price(prices, optionals=None, **kwargs):
    pass